using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace WindowsFormsApp1
{



    public partial class Form1 : Form
    {

        int i = 0;
        double rost = 0;
        double vaga = 0;
        double imt = 0;



        public Form1()
        {
            InitializeComponent();
        }

     
        private void textBox1_TextChanged(object sender, EventArgs e)
        {

        }

        private void button1_Click(object sender, EventArgs e)
        {


            rost = double.Parse(this.textBox1.Text);
            vaga = double.Parse(this.textBox2.Text);
            rost /= 100;

            imt = vaga / (rost * rost);

            this.textBox3.Visible = true;




            while (i != 2)
            {
                if (this.textBox3.Height != 200)
                {
                    this.textBox3.Height++;
                }

                if (this.textBox3.Height == 200)
                {
                    i = 2;
                }

            }

            if (radioButton5.Checked == true)
            {
                if (double.Parse(this.textBox4.Text) > 6 && double.Parse(this.textBox4.Text) < 8.1)
                {
                    if (imt < 14)
                    {
                        this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                    }
                    if (imt > 15.9 && imt < 20.1)
                    {
                        this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                    }
                    if (imt > 19.9 && imt < 25.1)
                    {
                        this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                    }
                    if (imt > 23.9)
                    {
                        this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                    }
                }
                if (double.Parse(this.textBox4.Text) > 8.9 && double.Parse(this.textBox4.Text) < 10.1)
                {
                    if (imt < 15)
                    {
                        this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                    }
                    if (imt > 15.9 && imt < 21.1)
                    {
                        this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                    }
                    if (imt > 20.9 && imt < 26.1)
                    {
                        this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                    }
                    if (imt > 24.9)
                    {
                        this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                    }

                }
                if (double.Parse(this.textBox4.Text) == 11)
                {
                    if (imt < 16)
                    {
                        this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                    }
                    if (imt > 16.9 && imt < 22.1)
                    {
                        this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                    }
                    if (imt > 21.9 && imt < 27.1)
                    {
                        this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                    }
                    if (imt > 25.9)
                    {
                        this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                    }
                }
                if (double.Parse(this.textBox4.Text) == 12)
                {
                    if (imt < 17)
                    {
                        this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                    }
                    if (imt > 17.9 && imt < 23.1)
                    {
                        this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                    }
                    if (imt > 22.9 && imt < 28.1)
                    {
                        this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                    }
                    if (imt > 26.9)
                    {
                        this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                    }
                }
                if (double.Parse(this.textBox4.Text) > 13.1 && double.Parse(this.textBox4.Text) < 14.1)
                {
                    if (imt < 18)
                    {
                        this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                    }
                    if (imt > 17.9 && imt < 23.1)
                    {
                        this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                    }
                    if (imt > 22.9 && imt < 28.1)
                    {
                        this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                    }
                    if (imt > 27.9)
                    {
                        this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                    }

                }
                if (double.Parse(this.textBox4.Text) > 14.9 && double.Parse(this.textBox4.Text) < 16.1)
                {
                    if (imt < 18)
                    {
                        this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                    }
                    if (imt > 17.9 && imt < 23.1)
                    {
                        this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                    }
                    if (imt > 22.9 && imt < 28.1)
                    {
                        this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                    }
                    if (imt > 27.9)
                    {
                        this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                    }

                }
                if (double.Parse(this.textBox4.Text) == 17)
                {

                    if (imt < 19)
                    {
                        this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                    }
                    if (imt > 18.9 && imt < 24.1)
                    {
                        this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                    }
                    if (imt > 23.9 && imt < 29.1)
                    {
                        this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                    }
                    if (imt > 28.9)
                    {
                        this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                    }


                }
                    if (double.Parse(this.textBox4.Text) > 18 && double.Parse(this.textBox4.Text) < 24.1)
                    {

                    if (imt < 20)
                    {
                        this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                    }
                    if (imt > 19.9 && imt < 25.1)
                    {
                        this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                    }
                    if (imt > 24.9 && imt < 30.1)
                    {
                        this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                    }
                    if (imt > 29.9)
                    {
                        this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                    }

                }
                if (double.Parse(this.textBox4.Text) > 24.9 && double.Parse(this.textBox4.Text) < 34.1)
                {
                    if (imt < 21)
                    {
                        this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                    }
                    if (imt > 20.9 && imt < 26.1)
                    {
                        this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                    }
                    if (imt > 25.9 && imt < 31.1)
                    {
                        this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                    }
                    if (imt > 30.9)
                    {
                        this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                    }
                }
                if (double.Parse(this.textBox4.Text) > 35 && double.Parse(this.textBox4.Text) < 44)
                {
                    if (imt < 22)
                    {
                        this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                    }
                    if (imt > 21.9 && imt < 27.1)
                    {
                        this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                    }
                    if (imt > 28.9 && imt < 32.1)
                    {
                        this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                    }
                    if (imt > 31.9)
                    {
                        this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                    }
                }
                if (double.Parse(this.textBox4.Text) > 45 && double.Parse(this.textBox4.Text) < 54)
                {
                    if (imt < 23)
                    {
                        this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                    }
                    if (imt > 22.9 && imt < 28.1)
                    {
                        this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                    }
                    if (imt > 29.9 && imt < 33.1)
                    {
                        this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                    }
                    if (imt > 32.9)
                    {
                        this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                    }
                }
                if (double.Parse(this.textBox4.Text) > 55)
                {
                    if (imt < 24)
                    {
                        this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                    }
                    if (imt > 23.9 && imt < 29.1)
                    {
                        this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                    }
                    if (imt > 30.9 && imt < 34.1)
                    {
                        this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                    }
                    if (imt > 33.9)
                    {
                        this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                    }
                }
            }


            if (radioButton2.Checked == true)
            {
                    if (double.Parse(this.textBox4.Text) > 6 && double.Parse(this.textBox4.Text) < 8.1)
                    {
                        if (imt < 14)
                        {
                            this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                        }
                        if (imt > 15.9 && imt < 20.1)
                        {
                            this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                        }
                        if (imt > 19.9 && imt < 25.1)
                        {
                            this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                        }
                        if (imt > 23.9)
                        {
                            this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                        }
                    }
                    if (double.Parse(this.textBox4.Text) > 8.9 && double.Parse(this.textBox4.Text) < 10.1)
                    {
                        if (imt < 15)
                        {
                            this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                        }
                        if (imt > 15.9 && imt < 21.1)
                        {
                            this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                        }
                        if (imt > 20.9 && imt < 26.1)
                        {
                            this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                        }
                        if (imt > 24.9)
                        {
                            this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                        }

                    }
                    if (double.Parse(this.textBox4.Text) == 11)
                    {
                        if (imt < 16)
                        {
                            this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                        }
                        if (imt > 16.9 && imt < 22.1)
                        {
                            this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                        }
                        if (imt > 21.9 && imt < 27.1)
                        {
                            this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                        }
                        if (imt > 25.9)
                        {
                            this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                        }
                    }
                    if (double.Parse(this.textBox4.Text) == 12)
                    {
                        if (imt < 17)
                        {
                            this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                        }
                        if (imt > 17.9 && imt < 23.1)
                        {
                            this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                        }
                        if (imt > 22.9 && imt < 28.1)
                        {
                            this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                        }
                        if (imt > 26.9)
                        {
                            this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                        }
                    }
                    if (double.Parse(this.textBox4.Text) > 13.1 && double.Parse(this.textBox4.Text) < 14.1)
                    {
                        if (imt < 18)
                        {
                            this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                        }
                        if (imt > 17.9 && imt < 23.1)
                        {
                            this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                        }
                        if (imt > 22.9 && imt < 28.1)
                        {
                            this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                        }
                        if (imt > 27.9)
                        {
                            this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                        }

                    }
                    if (double.Parse(this.textBox4.Text) > 14.9 && double.Parse(this.textBox4.Text) < 16.1)
                    {
                        if (imt < 18)
                        {
                            this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                        }
                        if (imt > 17.9 && imt < 23.1)
                        {
                            this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                        }
                        if (imt > 22.9 && imt < 28.1)
                        {
                            this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                        }
                        if (imt > 27.9)
                        {
                            this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                        }

                    }
                    if (double.Parse(this.textBox4.Text) == 17)
                    {

                        if (imt < 19)
                        {
                            this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                        }
                        if (imt > 18.9 && imt < 24.1)
                        {
                            this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                        }
                        if (imt > 23.9 && imt < 29.1)
                        {
                            this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                        }
                        if (imt > 28.9)
                        {
                            this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                        }
                    }
                        if (double.Parse(this.textBox4.Text) > 18 && double.Parse(this.textBox4.Text) < 24.1)
                {
                    if (imt < 19.1)
                    {
                        this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                    }
                    if (imt > 18.9 && imt < 24.1)
                    {
                        this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                    }
                    if (imt > 23.99 && imt < 30)
                    {
                        this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                    }
                    if (imt > 29.9)
                    {
                        this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                    }
                }
                if (double.Parse(this.textBox4.Text) > 25 && double.Parse(this.textBox4.Text) < 34)
                {
                    if (imt < 20.1)
                    {
                        this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                    }
                    if (imt > 19.9 && imt < 25.1)
                    {
                        this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                    }
                    if (imt > 24.99 && imt < 31)
                    {
                        this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                    }
                    if (imt > 30.9)
                    {
                        this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                    }
                }
                if (double.Parse(this.textBox4.Text) > 35 && double.Parse(this.textBox4.Text) < 44)
                {
                    if (imt < 21.1)
                    {
                        this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                    }
                    if (imt > 20.9 && imt < 26.1)
                    {
                        this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                    }
                    if (imt > 25.99 && imt < 32)
                    {
                        this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                    }
                    if (imt > 31.9)
                    {
                        this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                    }
                }
                if (double.Parse(this.textBox4.Text) > 44 && double.Parse(this.textBox4.Text) < 54)
                {
                    if (imt < 22.1)
                    {
                        this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                    }
                    if (imt > 21.9 && imt < 27.1)
                    {
                        this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                    }
                    if (imt > 26.99 && imt < 33)
                    {
                        this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                    }
                    if (imt > 32.9)
                    {
                        this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                    }
                }
                if (double.Parse(this.textBox4.Text) > 55 && double.Parse(this.textBox4.Text) < 65)
                {
                    if (imt < 23.1)
                    {
                        this.textBox3.Text = "Ви занатдо худі.Вам потрібно звернутися до лікаря, бо ви можете бути хворі на анарексію.";
                    }
                    if (imt > 22.9 && imt < 28.1)
                    {
                        this.textBox3.Text = "У вас все добре з вашою вагою.Продовжуйте підримувати ваше тіло у здоровому стані.:)";
                    }
                    if (imt > 27.99 && imt < 34)
                    {
                        this.textBox3.Text = "У вас є зайва вага.Вам потрібно почати займатися активними видами спорту, та правильно харчуватися";
                    }
                    if (imt > 33.9)
                    {
                        this.textBox3.Text = "У вас ожиріння.Вам потрібно звернутися до лікаря, щоб він вам назначив лікування.";
                    }
                }


            }

        }
        
        private void textBox2_TextChanged(object sender, EventArgs e)
        {

        }

        private void label1_Click(object sender, EventArgs e)
        {

        }

     

        private void radioButton2_CheckedChanged(object sender, EventArgs e)
        {

        }

        private void radioButton4_CheckedChanged(object sender, EventArgs e)
        {

        }

        private void radioButton5_CheckedChanged(object sender, EventArgs e)
        {

        }

        private void comboBox1_SelectedIndexChanged(object sender, EventArgs e)
        {

        }

        private void textBox4_TextChanged(object sender, EventArgs e)
        {

        }
    }
}
